CAL/r3-clase.org
#+SETUPFILE: ../setup/config.setup
#+TITLE: Relación 3 - Clase
#+LATEX_HEADER: \DeclareMathOperator{\R}{\mathbb{R}}

* Ejercicio 3

** Enunciado
Sea $x \in \R$. Prueba que el $\sup\{r \in \mathbb{Q}: r < x\} = x =
\inf\{s \in \mathbb{Q}: s > x\}$.  ¿Permanece válido este resultado si
se sustituye $\mathbb{Q}$ por un conjunto denso en $\R$?

** Demostración

Sea $A = \{r \in \mathbb{Q}: r < x \}$, está claro que $x$ es
mayorante de $A$.  Si $x$ no fuera el mínimo mayorante, existiría un
$y \in \R$, mayorante de $A$ tal que $y < x$.  Sin embargo, por la
densitud de $\mathbb{Q}$ en $\R$, existe $r \in \mathbb{Q}$, tal que
$y < r < x$.  Por tanto, $y$ no sería mayorante de $B$ y $x$ es
claramente el supremo.

Análogamente, sea $B = \{s \in \mathbb{Q}: s > x \}$, está claro que
$x$ es minorante de $B$. Si $x$ no fuera el máximo minorante,
existiría un $y \in \R$, minorante de $B$, tal que $y > x$.  Sin
embargo, por la densitud de $\mathbb{Q}$ en $\R$, existe $r \in
\mathbb{Q}$, tal que $y > r > x$.  Por tanto, $y$ no sería minorante
de $B$, y $x$ es claramente el ínfimo.

Permanecería válido pues la demostración no depende de $\mathbb{Q}$,
sino de su densitud en $\R$.
